Autodesk.Navisworks.Api.Units
Units of linear dimension.

Autodesk.Navisworks.Api.Units.Meters
SI meter. Distance light travels, in a vacuum, in 1 299,792,458th of a second

Autodesk.Navisworks.Api.Units.Centimeters
1 100th of an SI meter

Autodesk.Navisworks.Api.Units.Millimeters
1 1000th of an SI meter

Autodesk.Navisworks.Api.Units.Feet
1 3rd of a yard

Autodesk.Navisworks.Api.Units.Inches
1 12th of a foot, 2.54 centimeters exactly

Autodesk.Navisworks.Api.Units.Yards
Imperial yard, 0.9144 SI meters exactly

Autodesk.Navisworks.Api.Units.Kilometers
1000 SI meters

Autodesk.Navisworks.Api.Units.Miles
1760 yards

Autodesk.Navisworks.Api.Units.Micrometers
1 1,000,000th of an SI meter, a micron

Autodesk.Navisworks.Api.Units.Mils
1 1,000th of an inch

Autodesk.Navisworks.Api.Units.Microinches
1 1,000,000th of an inch